def block(b, p, key): #обработка одного блока
  b1 = b[0:int(len(b)/2)] #развиение блока пополам
  b2 = b[int(len(b)/2):len(b)]
  res = []
  for i in range(32):
    #res = [qwe]

  return res

def k(key): #преобразование ключа на блоки
  res = []
  for i in range(0,len(key),32):
    res.append(key[i:(i+32)])
  return res
  
def magma(text, alph):  #магма
  print("1. Зашифровать \n2. Расшифровать")
  l = int(input())
  #print("Введите ключ:") #ffeeddccbbaa99887766554433221100f0f1f2f3f4f5f6f7f8f9fafbfcfdfeff
  key = 'ffeeddccbbaa99887766554433221100f0f1f2f3f4f5f6f7f8f9fafbfcfdfeff'

  key = replace(key, alph)
  for i in range(len(key)):
    key[i] = format(key[i], '#08b')
  for i in range(len(key)):
    key[i].replace('0b', '')
  key = k(key)
  print(key)
  output = ''
  p = [[12, 4, 6, 2, 10, 5, 11, 9, 14, 8, 13, 7, 0, 3, 15, 1],[6, 8, 2, 3, 9, 10, 5, 12, 1, 14, 4, 7, 11, 13, 0, 15],[11, 3, 5, 8, 2, 15, 10, 13, 14, 1, 7, 4, 12, 9, 6, 0], [12, 8, 2, 1, 13, 4, 15, 6, 7, 0, 10, 5, 3, 14, 9, 11], [7, 15, 5, 10, 8, 1, 6, 13, 0, 9, 3, 14, 11, 4, 2, 12],[5, 13, 15, 6, 9, 2, 12, 10, 11, 7, 8, 1, 4, 3, 14, 0],[8, 14, 2, 5, 6, 9, 1, 12, 15, 4, 11, 0, 13, 10, 3, 7],[1, 7, 14, 13, 0, 5, 8, 3, 4, 15, 10, 6, 9, 12, 11, 2]]
  alphBin = replace(alph, alph)
  for i in range(len(alphBin)):#переводим в бинарный вид
    alphBin[i] = format(alphBin[i], '#010b')
  if l == 1:
    text = replace(text, alph)
    for i in range(len(text)):#переводим в бинарный вид
      text[i] = format(text[i], '#010b')
    blok = []
    if len(text)%8 != 0: #дополнение нехватающих битов
      w = 0
      while len(text)%8 != 0:
        text.append(alphBin[w])
        w+=1
    for i in range (0, len(text), 8): #разбиваем на блоки
      s = ""
      for j in range(8):
        s += text[i+j]
      blok.append(s)
    res = []
    print(blok)
    for i in range(len(blok)):
      res.append(block(blok[i], p, key))
    print(res)
  if l == 2:
    print(output)


def gost(text, alph): #ГОСТ 28147-89
  print("1. Зашифровать \n2. Расшифровать")
  l = int(input())
  res = ''
  if l == 1:
    print(res)
  if l == 2:
    print(res)

def grasshopper(text, alph): #Кузнечик
  print("1. Зашифровать \n2. Расшифровать")
  l = int(input())
  res = ''
  p = [252, 238, 221, 17, 207, 110, 49, 22, 251, 196, 250, 218, 35, 197, 4, 77, 233, 119, 240, 219, 147, 46, 153, 186, 23, 54, 241, 187, 20, 205, 95, 193, 249, 24, 101, 90, 226, 92, 239, 33, 129, 28, 60, 66, 139, 1, 142, 79, 5, 132, 2, 174, 227, 106, 143, 160, 6, 11, 237, 152, 127, 212, 211, 31, 235, 52, 44, 81, 234, 200, 72, 171, 242, 42, 104, 162, 253, 58, 206, 204, 181, 112, 14, 86, 8, 12, 118, 18, 191, 114, 19, 71, 156, 183, 93, 135, 21, 161, 150, 41, 16, 123, 154, 199, 243, 145, 120, 111, 157, 158, 178, 177, 50, 117, 25, 61, 255, 53, 138, 126, 109, 84, 198, 128, 195, 189, 13, 87, 223, 245, 36, 169, 62, 168, 67, 201, 215, 121, 214, 246, 124, 34, 185, 3, 224, 15, 236, 222, 122, 148, 176, 188, 220, 232, 40, 80, 78, 51, 10, 74, 167, 151, 96, 115, 30, 0, 98, 68, 26, 184, 56, 130, 100, 159, 38, 65, 173, 69, 70, 146, 39, 94, 85, 47, 140, 163, 165, 125, 105, 213, 149, 59, 7, 88, 179, 64, 134, 172, 29, 247, 48, 55, 107, 228, 136, 217, 231, 137, 225, 27, 131, 73, 76, 63, 248, 254, 141, 83, 170, 144, 202, 216, 133, 97, 32, 113, 103, 164, 45, 43, 9, 91, 203, 155, 37, 208, 190, 229, 108, 82, 89, 166, 116, 210, 230, 244, 180, 192, 209, 102, 175, 194, 57, 75, 99, 182]
  k = form_key(k)
  if l == 1:
    for i in range(10):
      v = v^k
      #for j in range(0,16,8):
       # vec = 
      
    print(res)
  if l == 2:
    print(res)

def form_key(key):
  k = []
  #for i in range(len(key)):    
  k.append()
  return k

def replace(rep, alph):  #преобразование букв алфавита в их порядковый номер
    res = []
    for i in range(0, len(rep)):
        for j in range(0, len(alph)):
            if (rep[i] == alph[j]):
                res.append(j + 1)
    return (res)


def replace2(rep, alph):  #преобразование номера буквы алфавита в букву
    res = ''
    for i in range(0, len(rep)):
        for j in range(0, len(alph)):
            if (int(rep[i] - 1) == j):
                res = res + alph[j]
    return (res)
  
#alph = [ "А", "Б", "В", "Г", "Д", "Е", "Ж", "З", "И", "Й", "К", "Л", "М", "Н", "О", "П", "Р", "С", "Т", "У", "Ф", "Х", "Ц", "Ч", "Ш", "Щ", "Ъ", "Ы", "Ь", "Э", "Ю", "Я", "а", "б", "в", "г", "д", "е", "ж", "з", "и", "й", "к", "л", "м", "н", "о", "п", "р", "с", "т", "у", "ф", "х", "ц", "ч", "ш", "щ", "ъ", "ы",  "ь", "э", "ю", "я", "-", ",", ".", " ", "–"]
alph = ["а","б","в","г","д","е","ж","з","и","й","к","л","м","н","о","п","р","с","т","у","ф","х","ц","ч","ш","щ","ъ","ы","ь","э","ю","я","0","1","2","3","4","5","6","7","8","9",'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z']
print(
    "Выбрать шифр: \n 1. МАГМА \n 2. ГОСТ 28147-89 \n 3. КУЗНЕЧИК \n 4. AES")
t = int(input())
print("Введите текст:")
text = input()
if (t == 1):
  magma(text, alph)
if (t == 2):
  gost(text)
if (t == 3):
  grasshopper(text)
